/*Реализовать следующие методы:
1. конструктор с параметрами 
2. деструктор
3. метод ввода данных в массив
4. вывод массива на экран
5. реализовать метод уножение двухмерных массивов
*/

#ifndef MATRIX_H                                                // Абарона ад паўторнага ўключэння файла.
#define MATRIX_H                                                // Макрас для абароны загаловачнага файла.

#include <vector>                                               // Падключэнне бібліятэкі вектараў.

class Matrix                                                    // Аб'яўленне класа для працы з матрыцамі.
{
private:                                                        // Схаваныя палі і дадзеныя класа.
    int rows;                                                   // Колькасць радкоў у матрыцы.
    int cols;                                                   // Колькасць слупкоў у матрыцы.
    std::vector<std::vector<int>> data;                         // Двухмерны вектар дадзеных.

public:                                                         // Адкрытыя метады і функцыі класа.
    Matrix(int r, int c);                                       // Канструктар з параметрамі для стварэння.

    void input();                                               // Метад для ўводу дадзеных у масіў.
    void print() const;                                         // Метад для вываду масіва на экран.
    Matrix multiply(const Matrix other) const;                  // Метад для множання дзвюх матрыц.
};

#endif                                                          // Канец абароны загаловачнага файла.