#ifndef MATRIX_H                                                // Абарона ад паўторнага ўключэння файла.
#define MATRIX_H                                                // Макрас для абароны загаловачнага файла.

class Matrix                                                    // Аб'яўленне класа для працы з матрыцамі.
{
private:                                                        // Схаваныя палі і дадзеныя класа.
    int rows;                                                   // Колькасць радкоў у матрыцы.
    int cols;                                                   // Колькасць слупкоў у матрыцы.
    int** data;                                                 // Дынамічны двухмерны масіў дадзеных.

public:                                                         // Адкрытыя метады і функцыі класа.
    Matrix(int r, int c);                                       // Канструктар з параметрамі для стварэння.
    ~Matrix();                                                  // Дэструктар для ачысткі выдзеленай памяці.

    void input();                                               // Метад для ўводу дадзеных у масіў.
    void print() const;                                         // Метад для вываду масіва на экран.
    Matrix* multiply(const Matrix& other) const;                // Метад для множання дзвюх матрыц.
};

#endif                                                          // Канец абароны загаловачнага файла.
