#include "matrix.h"                                             // Падключэнне загаловачнага файла матрыцы.
#include <iostream>                                             // Падключэнне бібліятэкі ўводу і вываду.

Matrix::Matrix(int r, int c)                                    // Рэалізацыя канструктара з параметрамі.
    : rows(r), cols(c), data(r, std::vector<int>(c, 0))         // Ініцыялізацыя памераў і запаўненне нулямі.
{
}

void Matrix::input()                                            // Рэалізацыя метаду ўводу элементаў масіва.
{
    for (int i = 0; i < rows; i++)                              // Вонкавы цыкл па ўсіх радках матрыцы.
    {
        for (int j = 0; j < cols; j++)                          // Унутраны цыкл па ўсіх слупках матрыцы.
        {
            std::cin >> data[i][j];                             // Зчытванне значэння элемента з клавіятуры.
        }
    }
}

void Matrix::print() const                                      // Рэалізацыя метаду вываду элементаў масіва.
{
    for (int i = 0; i < rows; i++)                              // Вонкавы цыкл па ўсіх радках матрыцы.
    {
        for (int j = 0; j < cols; j++)                          // Унутраны цыкл па ўсіх слупках матрыцы.
        {
            std::cout << data[i][j] << " ";                     // Вывад значэння элемента на экран.
        }

        std::cout << "\n";                                      // Пераход на новы радок пасля кожнага радка.
    }
}

Matrix Matrix::multiply(const Matrix other) const               // Рэалізацыя метаду множання дзвюх матрыц.
{
    Matrix result(rows, other.cols);                            // Стварэнне новай матрыцы для захавання выніку.

    for (int i = 0; i < rows; i++)                              // Цыкл па радках першай пачатковай матрыцы.
    {
        for (int j = 0; j < other.cols; j++)                    // Цыкл па слупках другой пачатковай матрыцы.
        {
            result.data[i][j] = 0;                              // Пачатковае абнуленне бягучага элемента выніку.

            for (int k = 0; k < cols; k++)                      // Цыкл для падліку сумы здабыткаў элементаў.
            {
                result.data[i][j] += data[i][k] * other.data[k][j]; // Вылічэнне элемента новай матрыцы.
            }
        }
    }

    return result;                                              // Вяртанне выніковай матрыцы па значэнні.
}